Importing required libraries: pandas, io, regex

In [40]:
import pandas as pd
from io import StringIO
import regex as re

Stringified Table from the challenge

In [50]:
data = 'Airline Code;DelayTimes;FlightCodes;To_From\nAir Canada (!);[21, 40];20015.0;WAterLoo_NEWYork\n<Air France> (12);[];;Montreal_TORONTO\n(Porter Airways. );[60, 22, 87];20035.0;CALgary_Ottawa\n12. Air France;[78, 66];;Ottawa_VANcouvER\n""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal\n'

Using StringIO library to read stringiifed table as a Pandas Dataframe

In [51]:
df = pd.read_csv(StringIO(data), delimiter=';')
df

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]      20015.0  WAterLoo_NEWYork
1   <Air France> (12)            []          NaN  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]      20035.0    CALgary_Ottawa
3      12. Air France      [78, 66]          NaN  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]      20055.0   london_MONTreal

Check Types of Columns

In [52]:
df.dtypes

Airline Code     object
DelayTimes       object
FlightCodes     float64
To_From          object
dtype: object

1. Editing FlightCodes Column: 
- Using df.iterrows() to edit the current FlightCodes value based on the last + 10, skipping the first row

In [53]:
for i, row in df.iterrows():
    if i > 0:
        df.loc[i, 'FlightCodes'] = df.loc[i - 1]['FlightCodes'] + 10
df

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]      20015.0  WAterLoo_NEWYork
1   <Air France> (12)            []      20025.0  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]      20035.0    CALgary_Ottawa
3      12. Air France      [78, 66]      20045.0  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]      20055.0   london_MONTreal

Setting the column to an integer column

In [54]:
df['FlightCodes'] = df['FlightCodes'].astype(int)
df

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]        20015  WAterLoo_NEWYork
1   <Air France> (12)            []        20025  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]        20035    CALgary_Ottawa
3      12. Air France      [78, 66]        20045  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]        20055   london_MONTreal

Verify by checking types once again

In [55]:
df.dtypes

Airline Code    object
DelayTimes      object
FlightCodes      int64
To_From         object
dtype: object

Splitting To_From column into two separate columns, "To" and "From", splitting on '_' and converting it to capital case and dropping the original column

In [56]:
df['To'] = df['To_From'].apply(lambda x: x.upper().split('_')[0])
df['From'] = df['To_From'].apply(lambda x: x.upper().split('_')[1])
df = df.drop(columns=['To_From'])
df

         Airline Code    DelayTimes  FlightCodes        To       From
0      Air Canada (!)      [21, 40]        20015  WATERLOO    NEWYORK
1   <Air France> (12)            []        20025  MONTREAL    TORONTO
2  (Porter Airways. )  [60, 22, 87]        20035   CALGARY     OTTAWA
3      12. Air France      [78, 66]        20045    OTTAWA  VANCOUVER
4   ".\.Lufthansa.\."      [12, 33]        20055    LONDON   MONTREAL

Lastly, use regex to clean the Airline Codes to have no punctuation except spaces in the middle. We clean so that "\<Air France\> (12)" becomes Air France

In [60]:
df['Airline Code'] = df['Airline Code'].apply(lambda x: re.sub(r'[^A-Za-z]+', ' ', x).strip())

Final dataframe results, both as a pandas dataframe and in the original stringified table form

In [61]:
df

     Airline Code    DelayTimes  FlightCodes        To       From
0      Air Canada      [21, 40]        20015  WATERLOO    NEWYORK
1      Air France            []        20025  MONTREAL    TORONTO
2  Porter Airways  [60, 22, 87]        20035   CALGARY     OTTAWA
3      Air France      [78, 66]        20045    OTTAWA  VANCOUVER
4       Lufthansa      [12, 33]        20055    LONDON   MONTREAL

In [62]:
df.to_csv(sep=';', index=False)

'Airline Code;DelayTimes;FlightCodes;To;From\nAir Canada;[21, 40];20015;WATERLOO;NEWYORK\nAir France;[];20025;MONTREAL;TORONTO\nPorter Airways;[60, 22, 87];20035;CALGARY;OTTAWA\nAir France;[78, 66];20045;OTTAWA;VANCOUVER\nLufthansa;[12, 33];20055;LONDON;MONTREAL\n'